// Оператор умови
// if - якщо (если)

/*

if (логічну операцію, результатом якої буде тип даних Boolean) {
    блок коду
}

Блок коду виконується тільки тоді, коли логічна операція = true

*/

// if (true) {
//     console.log('dscsdc');
//     // безліч коду
//     // if () {
//     //     if () {

//     //     }
//     // }
// }

/* if-else */
/* else - інакше (в противном случае) */

/*

if (логічна умова) {
    блок коду, який виконається, якщо умова = true
} else {
    блок коду, який виконається, якщо умова = false
}

*/

if (2+2 === 5) {
    console.log(true)
} else {
    console.log(false)
}

//////////////////////////

let a = 3;
let b = 5;
let n = 8;

if(b % 2 === 0) {
    n = n + 5; // n += 5
} else {
    a = 15;
}

// console.log(a, b, n);

/* if - else if - else

if (умова 1) {
    блок коду, який виконається, якщо умова1 = true
} else if (умова 2) {
    блок коду, який виконається, якщо умова2 = true
} else {
    блок коду, який виконається, якщо умова1 і умова2 = false
}

*/

/* 


Дано змінну r. Проініціалізуйте цю змінну якимось числовим значенням.
Якщо (r > 12) - вивести на консоль 'більше 12'
а якщо (r < 5) - вивести на консоль 'менша за 5',
в іншому випадку - вивести 'в діапазоні між 5 і 12'


*/

let r = 6;
if(r > 12) {
    console.log('більше 12');
} else if (r < 5) {
    console.log('менша за 5');
} else {
    console.log('в діапазона між 5 і 12');
}