/*

Задача 1

Маємо змінну min = 20

Якщо min попадає в першу чверть години - вивести на консоль "перша чверть".
Якщо min попадає в другу чверть години - вивести на консоль "друга чверть".
Якщо min попадає в третю чверть години - вивести на консоль "третя чверть".
Якщо min попадає в четверту чверть години - вивести на консоль "четверта чверть".

Задача 2

Дано два числа. Виведіть найбільше з цих чисел. 
Примітка. Створіть дві змінні, проініціалізуйте їх та порівняйте числа. Виведіть результат.

Задача 3

Потрібно визначити, чи цей рік є високосним. 
Примітка. Рік є високосним, якщо його номер кратний 4, але не кратний 100, а також якщо він кратний 400.

Задача 4

У вас є задане початкове і кінцеве значення діапазону, а також певне число. 
Вам потрібно визначити, чи входить це число в заданий діапазон. 
Якщо число знаходиться між початковим і кінцевим значеннями діапазону (включно), вивести "В діапазоні". 
В іншому випадку вивести "Поза діапазоном", оскільки число знаходиться поза початковим і кінцевим значеннями.

Задача 5 (*)

Козак Вус проводить змагання з програмування, в якому беруть участь n людей. 
Він вирішив нагородити їх усіх ручками та блокнотами. 
Відомо, що Ус має рівно m ручок і k блокнотів.
Визначте, чи може Козак нагородити всіх учасників, даючи кожному з них щонайменше по одній ручці та як мінімум по одному блокноту.

Задача 6 (**)

Ви є організатором розважальної програми і вам потрібно розподілити вхідні квитки на основі віку відвідувачів. 
Вхідні квитки мають різні ціни в залежності від віку відвідувачів. 
Вам потрібно реалізувати таку логіку, яка в залежності від віку відвідувача повертає вартість його квитка згідно наступних умов:

- Діти до 6 років: безкоштовний вхід
- Діти від 6 до 12 років (включно): квиток коштує $10
- Дорослі від 12 років і старше: квиток коштує $20

Якщо дорослий надає документ, що підтверджує його право на пільги, то такому дорослому надається знижка 50% (знижка для всіх дорослих фіксована, незалежно від виду пільги).

*/


// РЕАЛІЗАЦІЯ

// Задача 1

// const min = 24;
// if(min >= 0 && min <= 15) {
//     console.log('Перша чверть');
// } else if (min > 15 && min <= 30) {
//     console.log('Друга чверть');
// } else if (min > 30 && min <= 45) {
//     console.log('Третя чверть');
// } else if (min > 45 && min <= 60) {
//     console.log('Четверта чверть');
// } else if (min < 0 || min > 60 || typeof min !== 'number') {
//     console.log('Трапилась якась помилка!!');
// }



// Задача 2

// const num1 = 5;
// const num2 = 5;

// if(num1 > num2) {
//     console.log('Перше число більше: ' + num1);
// } else if (num2 > num1) {
//     console.log('Друге число більше: ' + num2);
// } else if (num1 === num2) {
//     console.log('Числа рівні!')
// } else {
//     console.log('Щось пішло не так...');
// }



// Задача 3

// Рік є високосним, якщо його номер кратний 4, але не кратний 100, або також якщо він кратний 400
// const year = 2012;
// if(year % 4 === 0 && year % 100 !== 0 || year % 400 === 0) {
//     console.log(year + ' є високосним');
// } else {
//     console.log('Рік не є високосним');
// }


// Задача 4

// const left = 10; // початкове значення
// const right = 20; // кінцеве значення

// const number = 9; // певне число, яке ми перевіряємо

// if (number >= left && number <= right) {
//     console.log('В діапазоні');
// } else {
//     console.log('Поза діапазоном');
// }



// Задача 5

// const n = 45; // кількість учасників
// const m = 43; // кількість ручок
// const k = 44; // кількість блокнотів

// if(m >= n && k >= n) {
//     console.log('Так, зможе нагородити!');
// } else {
//     console.log('Ні, не зможе нагородити!');
// }



// Задача 6

const age = 10; // Вік відвідувача
const hasDiscount = false; // Наявність знижки у дорослого

let ticketPrice; // Вартість квитка

if(age < 0 || typeof age !== 'number') {
    console.log('Ви ввели некоректний вік користувача');
} else if (age <= 6) {
    ticketPrice = 0;
} else if (age <= 12) {
    ticketPrice = 10;
} else if (!hasDiscount) { // !hasDickount -->> hasDiscount === false
    ticketPrice = 20;
} else {
    ticketPrice = 10;
}

if(ticketPrice !== undefined) {
    console.log('Вартість квитка складає: ' + ticketPrice + '$');
}