let a = 2+2;

let b = -2 + 4;
// console.log(b);

/* % - Залишок від цілочисельного поділу */
let div = 5 / 3; //
let rest = 5 % 3; // 2
// console.log(rest);

/*
12 тістечок -> 3 друзям
12 / 3 = 4 (зайвих тістечок немає)
Залишок від цілочисельного поділу = 0
*/

/*
15 тістечок -> 6 друзям
15 / 6 = 2 - результат цілочисельного поділу
12 тістечок

15 - 12 = 3 - залишок від цілочисельного поділу
*/

let pair = 4 % 2; // 0
let umPair = 5 % 2; // 1

//------

const x3 = 3 ** 3;
console.log('Значення змінної a -> ' + a + ', значення змінної b -> ' + b);