// -- Increment, decrement

let number = 1;
number++; // 1 + 1 = 2
number--; // 2 - 1 = 1
//console.log(number);

// Prefix
++number; // Інкремент буде виконано першим ділом, потім всі інші операції
--number; // Декремент буде виконано першим ділом, потім всі інші операції

// Postfix
number++; // Спочатку буде використано значення змінної, а після завершення операції вона інрементується
number--; // Спочатку буде використано значення змінної, а після завершення операції вона декрементується

let i = 0;
console.log('Перший консоль.лог: ' + i++);
console.log('Другий консоль.лог: ' + i);


///////

let k = 0;
k = k + 2; // 2
k = k - 1; // 1
console.log(k);

k += 2; // k = k + 2
k -= 2; // k = k - 2
k *= 4; // k = k * 4
k /= 2; // k = k / 2